# YOLO-Master v0.12 🚀 AGPL-3.0 License - https://ultralytics.com/license
# Based on OptimalHybridGateMoE: v0.6 winning core + v0.11 router upgrade +
# layer-adaptive split_ratio + lightweight residual DW refinement.
#
# MoE args: [out_channels, num_experts, top_k, split_ratio, ...extra]
# split_ratio is tuned per stage:
#   P3/P4 (layer 5): 0.5   — more dynamic capacity for fine-grained features
#   P4/P5 (layer 8): 0.5   — balanced
#   P5    (layer 11): 0.375 — more static capacity, feature map is small

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]

# YOLO-Master-v0.12 backbone with OptimalHybridGateMoE
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2

  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4

  - [-1, 1, OptimalHybridGateMoE, [512, 4, 2, 0.5]]   # 5 - MoE at P3/P4 junction

  - [-1, 1, Conv, [512, 3, 2]]        # 6-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]   # 7

  - [-1, 1, OptimalHybridGateMoE, [512, 8, 2, 0.5]]   # 8 - MoE at P4/P5 junction

  - [-1, 1, Conv, [1024, 3, 2]]       # 9-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]   # 10

  - [-1, 1, OptimalHybridGateMoE, [1024, 16, 2, 0.375]] # 11 - MoE at P5

# YOLO-Master-v0.12 detection head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]         # cat backbone P4
  - [-1, 2, C3k2, [512, True]]         # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]          # cat backbone P3
  - [-1, 2, C3k2, [256, True]]         # 17

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]         # cat head P4
  - [-1, 2, C3k2, [512, True]]         # 20

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]         # cat head P5
  - [-1, 2, C3k2, [512, True]]         # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]]     # Detect(P3, P4, P5)
