# EsMoE-N-P2 (dense): EsMoE-N MoE backbone + high-res P2/4 detection head (TPH-style).
# Reconstructed from the trained EsMoE-N-TPH checkpoint's model.yaml (the /tmp cfg was lost).
# 4-scale Detect [P2,P3,P4,P5] strides [4,8,16,32]. nc is overridden by the dataset yaml.

nc: 10
scales:
  n: [0.5, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, ES_MOE, [256]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, ES_MOE, [512]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, ES_MOE, [512]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 4, A2C2f, [1024, True, 1]]
  - [-1, 1, ES_MOE, [1024]]
head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 2, C3k2, [128, True]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 18], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]
  - [[21, 24, 27, 30], 1, Detect, [nc]]
