# YOLO-Master-v0.1-N-P2-UoMoE 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# UltraOptimizedMoE variant of our tiny-object winner yolo-master-n-p2.yaml.
# Identical P2/4-head backbone+neck; the three ModularRouterExpertMoE blocks are
# swapped for UltraOptimizedMoE (same [out, num_experts, top_k] args). Combines
# the two independent wins: the extra stride-4 (P2) detection head for tiny
# objects, and the deployment-optimized MoE (shared expert = stable like v0.1,
# batched sparse expert compute + ultra-light router = faster inference). Sparse
# train==eval with the shared path always on -> no --no-sparse-eval mismatch.
# Heads: P2/4, P3/8, P4/16, P5/32 -> Detect x4.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]                       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                      # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]               # 2-P2/4  (P2 feature source)

  - [-1, 1, Conv, [256, 3, 2]]                      # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]               # 4

  - [-1, 1, UltraOptimizedMoE, [512, 4, 2]]         # 5-P3/8  (P3 feature source)

  - [-1, 1, Conv, [512, 3, 2]]                      # 6-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]                  # 7

  - [-1, 1, UltraOptimizedMoE, [512, 8, 2]]         # 8-P4/16 (P4 feature source)

  - [-1, 1, Conv, [1024, 3, 2]]                     # 9-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]                 # 10

  - [-1, 1, UltraOptimizedMoE, [1024, 16, 2]]       # 11-P5/32 (P5 feature source)

head:
  # --- top-down (FPN) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 12
  - [[-1, 8], 1, Concat, [1]]                        # 13 cat backbone P4
  - [-1, 2, C3k2, [512, True]]                       # 14 (P4 td)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 15
  - [[-1, 5], 1, Concat, [1]]                         # 16 cat backbone P3
  - [-1, 2, C3k2, [256, True]]                        # 17 (P3 td)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 18
  - [[-1, 2], 1, Concat, [1]]                         # 19 cat backbone P2
  - [-1, 2, C3k2, [128, True]]                        # 20 (P2/4-tiny)   <- Detect P2

  # --- bottom-up (PAN) ---
  - [-1, 1, Conv, [128, 3, 2]]                       # 21
  - [[-1, 17], 1, Concat, [1]]                        # 22 cat head P3
  - [-1, 2, C3k2, [256, True]]                        # 23 (P3/8-small)  <- Detect P3

  - [-1, 1, Conv, [256, 3, 2]]                       # 24
  - [[-1, 14], 1, Concat, [1]]                        # 25 cat head P4
  - [-1, 2, C3k2, [512, True]]                        # 26 (P4/16-medium)<- Detect P4

  - [-1, 1, Conv, [512, 3, 2]]                       # 27
  - [[-1, 11], 1, Concat, [1]]                        # 28 cat backbone P5
  - [-1, 2, C3k2, [512, True]]                        # 29 (P5/32-large) <- Detect P5

  - [[20, 23, 26, 29], 1, Detect, [nc]]              # Detect(P2, P3, P4, P5)
