# YOLO-Master-v0.1-N-P2 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# P2-head variant of YOLO-Master-v0.1-N for tiny / densely-packed objects
# (VisDrone-style imagery). Adds an extra high-resolution P2/4 detection head
# on top of the stock P3/P4/P5 heads, following the TPH-YOLOv5 recipe of a
# dedicated tiny-object prediction head (its single largest ablation gain).
#
# The backbone is UNCHANGED from v0.1-N (same ModularRouterExpertMoE / A2C2f
# stack). Only the neck/head is extended: the FPN top-down path is carried one
# level further down to stride-4, and the PAN bottom-up path is re-rooted at P2.
# Heads: P2/4, P3/8, P4/16, P5/32  ->  Detect x4.
#
# Note: no transformer blocks are inserted at the new stride-4 head on purpose.
# Global attention at 160x160 (640 input) is prohibitively expensive for a Nano
# real-time model, and YOLO-Master already carries area-attention (A2C2f) plus
# MoE gating in the backbone; the portable P2 win here is the extra head.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]                       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                      # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]               # 2-P2/4  (P2 feature source)

  - [-1, 1, Conv, [256, 3, 2]]                      # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]               # 4

  - [-1, 1, ModularRouterExpertMoE, [512, 4, 2]]    # 5-P3/8  (P3 feature source)

  - [-1, 1, Conv, [512, 3, 2]]                      # 6-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]                  # 7

  - [-1, 1, ModularRouterExpertMoE, [512, 8, 2]]    # 8-P4/16 (P4 feature source)

  - [-1, 1, Conv, [1024, 3, 2]]                     # 9-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]                 # 10

  - [-1, 1, ModularRouterExpertMoE, [1024, 16, 2]]  # 11-P5/32 (P5 feature source)

head:
  # --- top-down (FPN) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 12
  - [[-1, 8], 1, Concat, [1]]                        # 13 cat backbone P4
  - [-1, 2, C3k2, [512, True]]                       # 14 (P4 td)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 15
  - [[-1, 5], 1, Concat, [1]]                         # 16 cat backbone P3
  - [-1, 2, C3k2, [256, True]]                        # 17 (P3 td)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 18
  - [[-1, 2], 1, Concat, [1]]                         # 19 cat backbone P2
  - [-1, 2, C3k2, [128, True]]                        # 20 (P2/4-tiny)   <- Detect P2

  # --- bottom-up (PAN) ---
  - [-1, 1, Conv, [128, 3, 2]]                       # 21
  - [[-1, 17], 1, Concat, [1]]                        # 22 cat head P3
  - [-1, 2, C3k2, [256, True]]                        # 23 (P3/8-small)  <- Detect P3

  - [-1, 1, Conv, [256, 3, 2]]                       # 24
  - [[-1, 14], 1, Concat, [1]]                        # 25 cat head P4
  - [-1, 2, C3k2, [512, True]]                        # 26 (P4/16-medium)<- Detect P4

  - [-1, 1, Conv, [512, 3, 2]]                       # 27
  - [[-1, 11], 1, Concat, [1]]                        # 28 cat backbone P5
  - [-1, 2, C3k2, [512, True]]                        # 29 (P5/32-large) <- Detect P5

  - [[20, 23, 26, 29], 1, Detect, [nc]]              # Detect(P2, P3, P4, P5)
