# YOLO-Master-v0.1-N-UoMoE 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# UltraOptimizedMoE variant of YOLO-Master-v0.1-N. Identical backbone/head to
# yolo-master-n.yaml, with the three ModularRouterExpertMoE blocks swapped for
# UltraOptimizedMoE (same [out, num_experts, top_k] args). UltraOptimizedMoE is
# the deployment-optimized MoE generation: always-on shared expert (stable, like
# v0.1 — not ES_MOE), z-loss + differentiable balance loss, an ultra-light
# depthwise router (~95% fewer routing FLOPs), and batched sparse expert compute
# (no per-expert Python loop) for faster inference. Sparse at train AND eval with
# the shared path always on -> train==eval consistent (no --no-sparse-eval needed).

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]

  - [-1, 1, UltraOptimizedMoE, [512, 4, 2]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 4, A2C2f, [512, True, 4]]

  - [-1, 1, UltraOptimizedMoE, [512, 8, 2]]

  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 4, A2C2f, [1024, True, 1]]

  - [-1, 1, UltraOptimizedMoE, [1024, 16, 2]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [[17, 20, 23], 1, Detect, [nc]]
